In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'city':["Kolkata","Chennai","Bengalore","Mumbai","Delhi","Kolkata","Chennai"],
    'rating':[9.8, 7.7, 8.7, 8.2, 6.5, 8.3, 7.4]
}

df = pd.DataFrame(data)

df

        city  rating
0    Kolkata     9.8
1    Chennai     7.7
2  Bengalore     8.7
3     Mumbai     8.2
4      Delhi     6.5
5    Kolkata     8.3
6    Chennai     7.4

In [4]:
# detect duplicate

df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [5]:
df.duplicated("city")

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [6]:
df.duplicated("city").sum()

2

In [8]:
duplicate = df[df.duplicated("city")]

duplicate

      city  rating
5  Kolkata     8.3
6  Chennai     7.4

In [12]:
# remove duplicates by keeping only the first occurence

df.drop_duplicates("city", keep="first", inplace=True)

In [13]:
df

        city  rating
0    Kolkata     9.8
1    Chennai     7.7
2  Bengalore     8.7
3     Mumbai     8.2
4      Delhi     6.5